dates = {1: {(1, 20): 'capricorn',
             (21, 31): 'aquarius'},
         2: {(1, 19): 'aquarius',
             (20, 29): 'pisces'},
         3: {(1, 20): 'pisces',
             (21, 31): 'aries'},
         4: {(1, 20): 'aries',
             (21, 30): 'taurus'},
         5: {(1, 21): 'taurus',
             (22, 31): 'gemini'},
         6: {(1, 21): 'gemini',
             (22, 30): 'cancer'},
         7: {(1, 22): 'cancer',
             (23, 31): 'leo'},
         8: {(1, 21): 'leo',
             (22, 31): 'virgo'},
         9: {(1, 23): 'virgo',
             (24, 30): 'libra'},
         10: {(1, 23): 'libra',
              (24, 31): 'scorpio'},
         11: {(1, 22): 'scorpio',
              (23, 30): 'sagittarius'},
         12: {(1, 22): 'sagittarius',
              (23, 31): 'capricorn'}
         }

zodiac_dict = {
    "aries": "Овен - первый знак зодиака, планета Марс (с 21 марта по 20 апреля).",
    "taurus": "Телец - второй знак зодиака, планета Венера (с 21 апреля по 21 мая).",
    "gemini": "Близнецы - третий знак зодиака, планета Меркурий (с 22 мая по 21 июня).",
    "cancer": "Рак - четвёртый знак зодиака, Луна (с 22 июня по 22 июля).",
    "leo": "Лев - пятый знак зодиака, солнце (с 23 июля по 21 августа).",
    "virgo": "Дева - шестой знак зодиака, планета Меркурий (с 22 августа по 23 сентября).",
    "libra": "Весы - седьмой знак зодиака, планета Венера (с 24 сентября по 23 октября).",
    "scorpio": "Скорпион - восьмой знак зодиака, планета Марс (с 24 октября по 22 ноября).",
    "sagittarius": "Стрелец - девятый знак зодиака, планета Юпитер (с 23 ноября по 22 декабря).",
    "capricorn": "Козерог - десятый знак зодиака, планета Сатурн (с 23 декабря по 20 января).",
    "aquarius": "Водолей - одиннадцатый знак зодиака, планеты Уран и Сатурн (с 21 января по 19 февраля).",
    "pisces": "Рыбы - двенадцатый знак зодиака, планеты Юпитер (с 20 февраля по 20 марта)."
}

zodiac_type = {
    'fire': ['aries', 'leo', 'sagittarius'],
    'earth': ['taurus', 'virgo', 'capricorn'],
    'air': ['gemini', 'libra', 'aquarius'],
    'water': ['cancer', 'scorpio', 'pisces']
}
